In [12]:
import pandas as pd
name = 'INFY'

In [13]:
sym = 'b' * (10 - len(name)) + name
print(sym)

bbbbbbINFY

In [14]:
df = pd.read_csv('CASH_Trades_03072018.DAT', header = None)

In [15]:
df.head()

                                                   0
0  RMCASH201807030000000179631223195167bbAARTIIND...
1  RMCASH201807030000000279631223195168bbbbbbABAN...
2  RMCASH201807030000000379631223195169bbbbbbABAN...
3  RMCASH201807030000000479631223195170bbbbbbABAN...
4  RMCASH201807030000000579631223195171bbbbbbABAN...

In [16]:
df = df[df[0].str[36:46] == sym]

In [17]:
df.head()

                                                         0
2313400  RMCASH201807032500132079631223196256bbbbbbINFY...
2313401  RMCASH201807032500132179631223196257bbbbbbINFY...
2313402  RMCASH201807032500132279631223196258bbbbbbINFY...
2313403  RMCASH201807032500132379631223196259bbbbbbINFY...
2313404  RMCASH201807032500132479631223196260bbbbbbINFY...

In [18]:

df['trade_time'] = df[0].str[22:36]                      # 22:36
df['price'] = df[0].str[48:56].astype(int) / 100        # 48:56 -> int /100
df['quantity'] = df[0].str[56:64].astype(int)           # 56:64 -> int
df['buy_order_number'] = df[0].str[64:80]               # 64:80
df['sell_order_number'] = df[0].str[82:98]              # 82:98

In [19]:
df = df.drop(columns=[0])

In [20]:
df.to_parquet(f'{name}_trade.parquet')

In [21]:
df.head()

             trade_time   price  quantity  buy_order_number sell_order_number
2313400  79631223196256  1331.9         5  1100000000011752  1100000000065484
2313401  79631223196257  1331.9         4  1100000000065637  1100000000065484
2313402  79631223196258  1331.9         1  1100000000054362  1100000000065484
2313403  79631223196259  1331.9        20  1100000000011652  1100000000044489
2313404  79631223196260  1331.9        20  1100000000011652  1100000000058868

In [22]:
len(df)

140810